02_OpenFOAM_FVM/cases/Ejercicio4/Parte1_FVM/OneDScalar_5celdas_linear/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    in
    {
        type            fixedValue;
        value           uniform 1;
    }

    out
    {
        type            fixedValue;
        value           uniform 0;
    }

    emptywalls
    {
        type            empty;
    }
}

// ************************************************************************* //
