02_OpenFOAM_FVM/cases/Ejercicio4/Parte1_FVM/OneDScalar_5celdas_linear/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="$(getApplication)"

runApplication blockMesh
runApplication $application

#------------------------------------------------------------------------------
